pmamatis/NAA-Measurment-Carrier-System/Code/C/board/pin_mux.c
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v12.0
processor: LPC54S018
package_id: LPC54S018JET180
mcu_data: ksdk2_0
processor_version: 12.0.0
board: LPCXpresso54S018
pin_labels:
- {pin_num: K12, pin_signal: PIO1_1/FC3_RXD_SDA_MOSI/CTIMER0_CAP3/SCT0_GPI5/FC10_RXD_SDA_MOSI/USB1_OVERCURRENTN, label: PCIe2_Plug_in_sensing, identifier: SW5;PIS_I_2;PIS_2;PS_3V3_2;PIS_2_INT}
- {pin_num: H4, pin_signal: PIO3_13/SCT0_OUT9/FC9_CTS_SDA_SSEL0/CTIMER3_CAP1/EMC_FBCK/TRACEDATA(1), label: PCIe2_Power_swichting_3V3Aux, identifier: PS2_2;PS_AUX_2}
- {pin_num: F11, pin_signal: PIO0_13/FC1_CTS_SDA_SSEL0/UTICK_CAP0/CTIMER0_CAP0/SCT0_GPI0/ENET_RXD0, label: PCIe2_PowerMeasurement_I2C_SDA, identifier: SMB1_SDA;PM2_SDA;PM2_SDA_HS}
- {pin_num: E13, pin_signal: PIO0_14/FC1_RTS_SCL_SSEL1/UTICK_CAP1/CTIMER0_CAP1/SCT0_GPI1/ENET_RXD1, label: PCIe2_PowerMeasurement_I2C_SCL, identifier: SMB1_SCL;PM2_SCL;PM2_SCL_HS}
- {pin_num: E2, pin_signal: PIO3_24/FC2_RTS_SCL_SSEL1/CTIMER4_CAP0/USB0_VBUS, label: PCIe1_PowerMeasurement_I2C_SCL, identifier: FC2_SCLX;SMB_SCL_PCIE1;SMB_SCL_PCIe2;SMB2_SCL;PM1_SCL;PM1_SCL_HS}
- {pin_num: C2, pin_signal: PIO3_23/FC2_CTS_SDA_SSEL0/UTICK_CAP3, label: PCIe1_PowerMeasurement_I2C_SDA, identifier: FC2_SDAX;SMB_PCIE1;SMB_SDA_PCIE1;SMB_SDA_PCIe2;SMB2_SDA;PM1_SDA;PM1_SDA_HS}
- {pin_num: M13, pin_signal: PIO0_26/FC2_RXD_SDA_MOSI/CLKOUT/CTIMER3_CAP2/SCT0_OUT5/PDM0_CLK/SPIFI_CLK/USB0_IDVALUE/FC10_CTS_SDA_SSEL0, label: NC}
- {pin_num: L9, pin_signal: PIO0_27/FC2_TXD_SCL_MISO/CTIMER3_MAT2/SCT0_OUT6/PDM0_DATA/SPIFI_IO(3), label: NC}
- {pin_num: P1, pin_signal: PIO2_10/ENET_RX_ER/SD_CARD_DET_N, label: PCIe2_JTAG_TDO, identifier: JTAG_TDO_2}
- {pin_num: F4, pin_signal: PIO2_8/ENET_RXD2/SD_D(2)/CTIMER0_MAT0, label: SUPP_2_Power_switching, identifier: SD_D2;PS_12V_4}
- {pin_num: J2, pin_signal: PIO2_7/ENET_COL/SD_D(1)/FREQME_GPIO_CLK_B/CTIMER0_CAP1, label: PCIe1_Power_switching_3V3, identifier: PS1_1;PS_3V3_1}
- {pin_num: P9, pin_signal: PIO3_25/CTIMER4_CAP2/FC4_SCK/EMC_A(14), label: PCIe1_PERST#, identifier: PCIe1_reset;PCIe1_RST_1;RST_1}
- {pin_num: F10, pin_signal: PIO1_27/FC2_RTS_SCL_SSEL1/SD_D(4)/CTIMER0_MAT3/CLKOUT/EMC_A(9), label: NC}
- {pin_num: P8, pin_signal: PIO1_8/FC0_CTS_SDA_SSEL0/SD_CLK/SCT0_OUT1/FC4_SSEL2/EMC_A(7), label: PCIe1_JTAG_TDI, identifier: JTAG_TDI_1}
- {pin_num: N1, pin_signal: PIO1_7/FC0_RTS_SCL_SSEL1/SD_D(1)/CTIMER2_MAT2/SCT0_GPI4/EMC_A(6), label: PCIe2_PERST#, identifier: PCIe2_reset;RST_2}
- {pin_num: G4, pin_signal: PIO1_6/FC0_TXD_SCL_MISO/SD_D(3)/CTIMER2_MAT1/SCT0_GPI3/EMC_A(5), label: PCIe2_Power_switching_12V, identifier: PS0_2;PS_12V_2}
- {pin_num: M1, pin_signal: PIO1_20/FC7_RTS_SCL_SSEL1/CTIMER3_CAP2/FC4_TXD_SCL_MISO/EMC_D(9), label: SUPP_1_Power_switching, identifier: PS3_1;PS_12V_3}
- {pin_num: G12, pin_signal: PIO0_9/FC3_SSEL2/SD_POW_EN/FC5_TXD_SCL_MISO/SCI1_IO/EMC_D(7), label: NC}
- {pin_num: G10, pin_signal: PIO1_13/ENET_RXD1/FC6_RXD_SDA_MOSI_DATA/CTIMER1_CAP2/USB0_OVERCURRENTN/USB0_FRAME/EMC_DQM(0), label: NC}
- {pin_num: K14, pin_signal: PIO2_24/LCD_VD(6)/SCT0_OUT9/FC10_SSEL3, label: NC}
- {pin_num: G11, pin_signal: PIO2_29/LCD_VD(11)/FC7_RTS_SCL_SSEL1/FC8_TXD_SCL_MISO/CTIMER2_CAP3/CLKOUT, label: NC}
- {pin_num: D12, pin_signal: PIO3_0/LCD_VD(14)/PDM0_CLK/CTIMER1_MAT0, label: NC}
- {pin_num: P7, pin_signal: PIO2_13/LCD_DCLK/SD_VOLT(2)/FC5_TXD_SCL_MISO, label: PCIe1_JTAG_TDO, identifier: JTAG_TDO_1}
- {pin_num: F13, pin_signal: PIO4_3/FC6_TXD_SCL_MISO_WS/CTIMER0_CAP3/SCT0_GPI4/EMC_DYCSN(2), label: PCIe1_PowerMeasurement_I2C_SCL, identifier: I2C_PCIe2_SCL;PM2_SCL;PM1_SCL}
- {pin_num: F14, pin_signal: PIO4_2/FC6_RXD_SDA_MOSI_DATA/SCT0_GPI3/EMC_CSN(3), label: PCIe1_PowerMeasurement_I2C_SDA, identifier: PM2_SDA;PM1_SDA}
- {pin_num: P12, pin_signal: PIO2_19/LCD_VD(1)/FC3_TXD_SCL_MISO/FC7_RXD_SDA_MOSI_DATA/CTIMER3_MAT1, label: DebugLED_2, identifier: DebugLED_2}
- {pin_num: N10, pin_signal: PIO2_18/LCD_VD(0)/FC3_RXD_SDA_MOSI/FC7_SCK/CTIMER3_MAT0, label: PMBus, identifier: PMBus_SDA}
- {pin_num: P13, pin_signal: PIO2_20/LCD_VD(2)/FC3_RTS_SCL_SSEL1/FC7_TXD_SCL_MISO_WS/CTIMER3_MAT2/CTIMER4_CAP0, label: PMBus, identifier: PMBus_SCL}
- {pin_num: D1, pin_signal: PIO1_18/FC8_TXD_SCL_MISO/SCT0_OUT5/CAN1_RD/EMC_BLSN(1), label: 'J9[2]/P1_18-CAN1_RD', identifier: FC8_SCL}
- {pin_num: M4, pin_signal: PIO0_16/FC4_TXD_SCL_MISO/CLKOUT/CTIMER1_CAP0/EMC_CSN(0)/ENET_TXD0/ADC0_4, label: NC}
- {pin_num: M5, pin_signal: PIO0_31/FC0_CTS_SDA_SSEL0/SD_D(2)/CTIMER0_MAT1/SCT0_OUT3/TRACEDATA(0)/ADC0_5, label: NC}
- {pin_num: N3, pin_signal: PIO1_0/FC0_RTS_SCL_SSEL1/SD_D(3)/CTIMER0_CAP2/SCT0_GPI4/TRACECLK/ADC0_6, label: PCIe1_Plug_in_sensing, identifier: PIS_1;PIS_I_1;PIS_1_INT}
- {pin_num: N12, pin_signal: PIO1_17/ENET_MDIO/FC8_RXD_SDA_MOSI/SCT0_OUT4/CAN1_TD/EMC_BLSN(0), label: DebugLED_1, identifier: DebugLED_1}
- {pin_num: P11, pin_signal: PIO1_22/FC8_RTS_SCL_SSEL1/SD_CMD/CTIMER2_MAT3/SCT0_GPI5/FC4_SSEL3/EMC_CKE(1), label: I2C_SUPP_SCL, identifier: SUPP_SCL}
- {pin_num: P3, pin_signal: PIO2_0/FC0_RXD_SDA_MOSI/CTIMER1_CAP0/ADC0_7, label: PCIe2_JTAG_TDI, identifier: JTAG_TDI_2}
- {pin_num: P4, pin_signal: PIO2_1/FC0_TXD_SCL_MISO/CTIMER1_MAT0/ADC0_8, label: JTAG_TMS, identifier: JTAG_TMS}
- {pin_num: P10, pin_signal: PIO2_17/LCD_CLKIN/USB1_LEDN/USB1_OVERCURRENTN/CTIMER1_CAP1/FC8_RXD_SDA_MOSI, label: I2C_SUPP_SDA, identifier: SUPP_SDA}
- {pin_num: H14, pin_signal: PIO2_27/LCD_VD(9)/FC9_SCK/FC3_SSEL2, label: NC}
- {pin_num: C10, pin_signal: PIO3_2/LCD_VD(16)/FC9_RXD_SDA_MOSI/CTIMER1_MAT2, label: NC, identifier: PS4_1}
- {pin_num: K1, pin_signal: PIO3_17/FC8_TXD_SCL_MISO/SD_D(5), label: PCIe2_Power_switching_3V3, identifier: PS1_2;PS_3V3_2}
- {pin_num: N2, pin_signal: PIO3_20/FC9_SCK/SD_CARD_INT_N/CLKOUT/SCT0_OUT7, label: JTAG_CLK, identifier: JTAG_TCK}
- {pin_num: P5, pin_signal: PIO3_21/FC9_RXD_SDA_MOSI/SD_BACKEND_PWR/CTIMER4_MAT3/UTICK_CAP2/ADC0_9, label: PCIe2_PowerMeasurement_I2C_SDA, identifier: FC9_SDA;PM2_SDA}
- {pin_num: N5, pin_signal: PIO3_22/FC9_TXD_SCL_MISO/ADC0_10, label: PCIe2_PowerMeasurement_I2C_SCL, identifier: FC9_SCL;PM2_;PM2_SCL}
- {pin_num: K5, pin_signal: PIO3_26/SCT0_OUT0/FC4_RXD_SDA_MOSI/EMC_A(15), label: PCIe1_Power_switching_3V3Aux, identifier: PS2_1;PS_AUX_1}
- {pin_num: P14, pin_signal: PIO3_27/SCT0_OUT1/FC4_TXD_SCL_MISO/EMC_A(16), label: DebugLED_0, identifier: DebugLED_0}
- {pin_num: M11, pin_signal: PIO3_28/SCT0_OUT2/FC4_CTS_SDA_SSEL0/EMC_A(17), label: NC}
- {pin_num: L13, pin_signal: PIO3_29/SCT0_OUT3/FC4_RTS_SCL_SSEL1/EMC_A(18), label: NC}
- {pin_num: K13, pin_signal: PIO3_30/FC9_CTS_SDA_SSEL0/SCT0_OUT4/FC4_SSEL2/EMC_A(19), label: NC}
- {pin_num: H13, pin_signal: PIO4_0/FC6_CTS_SDA_SSEL0/CTIMER4_CAP1/SCT0_GPI1/EMC_CSN(1), label: NC}
- {pin_num: D9, pin_signal: PIO4_4/FC4_SSEL3/FC0_RTS_SCL_SSEL1/SCT0_GPI5/EMC_DYCSN(3), label: PCIe1_Power_switching_12V, identifier: PS0_1;PS_12V_1}
- {pin_num: E10, pin_signal: PIO4_5/FC9_CTS_SDA_SSEL0/FC0_CTS_SDA_SSEL0/CTIMER4_MAT3/SCT0_GPI6/EMC_CKE(2), label: NC}
- {pin_num: K7, pin_signal: VSS6, label: NC}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_gpio.h"
#include "fsl_iocon.h"
#include "fsl_inputmux.h"
#include "pin_mux.h"

