pmamatis/NAA-Measurment-Carrier-System/Code/C/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : PIN_INIT_SWD_DEBUGPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M4F */
void PIN_INIT_SWD_DEBUGPins(void)
{
    /* Enables the clock for the IOCON block. 0 = Disable; 1 = Enable.: 0x01u */
    CLOCK_EnableClock(kCLOCK_Iocon);

    const uint32_t SWO_TRGT = (/* Pin is configured as SWO */
                               IOCON_PIO_FUNC6 |
                               /* No addition pin function */
                               IOCON_PIO_MODE_INACT |
                               /* Disable analog Mode */
                               IOCON_PIO_ANAMODE_DI |
                               /* Input function is not inverted */
                               IOCON_PIO_INV_DI |
                               /* Enables digital function */
                               IOCON_PIO_DIGITAL_EN |
                               /* Input filter disabled */
                               IOCON_PIO_INPFILT_OFF |
                               /* Open drain is disabled */
                               IOCON_PIO_OPENDRAIN_DI);
    /* PORT0 PIN10 (coords: P2) is configured as SWO */
    IOCON_PinMuxSet(IOCON, PIN_SWD_DEBUG_SWO_TRGT_PORT, PIN_SWD_DEBUG_SWO_TRGT_PIN, SWO_TRGT);

    const uint32_t SWDCLK_TRGT = (/* Pin is configured as SWCLK */
                                  IOCON_PIO_FUNC6 |
                                  /* No addition pin function */
                                  IOCON_PIO_MODE_INACT |
                                  /* Disable analog Mode */
                                  IOCON_PIO_ANAMODE_DI |
                                  /* Input function is not inverted */
                                  IOCON_PIO_INV_DI |
                                  /* Enables digital function */
                                  IOCON_PIO_DIGITAL_EN |
                                  /* Input filter disabled */
                                  IOCON_PIO_INPFILT_OFF |
                                  /* Open drain is disabled */
                                  IOCON_PIO_OPENDRAIN_DI);
    /* PORT0 PIN11 (coords: L3) is configured as SWCLK */
    IOCON_PinMuxSet(IOCON, PIN_SWD_DEBUG_SWDCLK_TRGT_PORT, PIN_SWD_DEBUG_SWDCLK_TRGT_PIN, SWDCLK_TRGT);

    const uint32_t IF_SWDIO = (/* Pin is configured as SWDIO */
                               IOCON_PIO_FUNC6 |
                               /* No addition pin function */
                               IOCON_PIO_MODE_INACT |
                               /* Disable analog Mode */
                               IOCON_PIO_ANAMODE_DI |
                               /* Input function is not inverted */
                               IOCON_PIO_INV_DI |
                               /* Enables digital function */
                               IOCON_PIO_DIGITAL_EN |
                               /* Input filter disabled */
                               IOCON_PIO_INPFILT_OFF |
                               /* Open drain is disabled */
                               IOCON_PIO_OPENDRAIN_DI);
    /* PORT0 PIN12 (coords: M3) is configured as SWDIO */
    IOCON_PinMuxSet(IOCON, PIN_SWD_DEBUG_IF_SWDIO_PORT, PIN_SWD_DEBUG_IF_SWDIO_PIN, IF_SWDIO);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
PIN_INIT_PCIeFunctionPins:
- options: {callFromInitBoot: 'false', prefix: PIN_PCIE_FUNCTION_, coreID: core0, enableClock: 'true', fullInit: 'true'}
- pin_list:
  - {pin_num: N1, peripheral: GPIO, signal: 'PIO1, 7', pin_signal: PIO1_7/FC0_RTS_SCL_SSEL1/SD_D(1)/CTIMER2_MAT2/SCT0_GPI4/EMC_A(6), identifier: RST_2, direction: OUTPUT,
    gpio_init_state: 'false', mode: inactive, invert: disabled, glitch_filter: disabled, slew_rate: standard, open_drain: disabled}
  - {pin_num: P9, peripheral: GPIO, signal: 'PIO3, 25', pin_signal: PIO3_25/CTIMER4_CAP2/FC4_SCK/EMC_A(14), identifier: RST_1, direction: OUTPUT, gpio_init_state: 'false',
    mode: inactive, invert: disabled, glitch_filter: disabled, slew_rate: standard, open_drain: disabled}
  - {pin_num: H4, peripheral: GPIO, signal: 'PIO3, 13', pin_signal: PIO3_13/SCT0_OUT9/FC9_CTS_SDA_SSEL0/CTIMER3_CAP1/EMC_FBCK/TRACEDATA(1), identifier: PS_AUX_2,
    direction: OUTPUT, gpio_init_state: 'false', mode: inactive, invert: disabled, glitch_filter: disabled, slew_rate: standard, open_drain: disabled}
  - {pin_num: J2, peripheral: GPIO, signal: 'PIO2, 7', pin_signal: PIO2_7/ENET_COL/SD_D(1)/FREQME_GPIO_CLK_B/CTIMER0_CAP1, identifier: PS_3V3_1, direction: OUTPUT,
    gpio_init_state: 'false', mode: inactive, invert: disabled, glitch_filter: disabled, slew_rate: standard, open_drain: disabled}
  - {pin_num: M1, peripheral: GPIO, signal: 'PIO1, 20', pin_signal: PIO1_20/FC7_RTS_SCL_SSEL1/CTIMER3_CAP2/FC4_TXD_SCL_MISO/EMC_D(9), identifier: PS_12V_3, direction: OUTPUT,
    gpio_init_state: 'false', mode: inactive, invert: disabled, glitch_filter: disabled, slew_rate: standard, open_drain: disabled}
  - {pin_num: G4, peripheral: GPIO, signal: 'PIO1, 6', pin_signal: PIO1_6/FC0_TXD_SCL_MISO/SD_D(3)/CTIMER2_MAT1/SCT0_GPI3/EMC_A(5), identifier: PS_12V_2, direction: OUTPUT,
    gpio_init_state: 'false', mode: inactive, invert: disabled, glitch_filter: disabled, slew_rate: standard, open_drain: disabled}
  - {pin_num: K1, peripheral: GPIO, signal: 'PIO3, 17', pin_signal: PIO3_17/FC8_TXD_SCL_MISO/SD_D(5), identifier: PS_3V3_2, direction: OUTPUT, gpio_init_state: 'false',
    mode: inactive, invert: disabled, glitch_filter: disabled, slew_rate: standard, open_drain: disabled}
  - {pin_num: D9, peripheral: GPIO, signal: 'PIO4, 4', pin_signal: PIO4_4/FC4_SSEL3/FC0_RTS_SCL_SSEL1/SCT0_GPI5/EMC_DYCSN(3), identifier: PS_12V_1, direction: OUTPUT,
    gpio_init_state: 'false', mode: inactive, invert: disabled, glitch_filter: disabled, slew_rate: standard, open_drain: disabled}
  - {pin_num: K5, peripheral: GPIO, signal: 'PIO3, 26', pin_signal: PIO3_26/SCT0_OUT0/FC4_RXD_SDA_MOSI/EMC_A(15), identifier: PS_AUX_1, direction: OUTPUT, gpio_init_state: 'false',
    mode: inactive, invert: disabled, glitch_filter: disabled, slew_rate: standard, open_drain: disabled}
  - {pin_num: F4, peripheral: GPIO, signal: 'PIO2, 8', pin_signal: PIO2_8/ENET_RXD2/SD_D(2)/CTIMER0_MAT0, identifier: PS_12V_4, direction: OUTPUT, gpio_init_state: 'false',
    mode: inactive, invert: disabled, glitch_filter: disabled, slew_rate: standard, open_drain: disabled}
  - {pin_num: K12, peripheral: GPIO, signal: 'PIO1, 1', pin_signal: PIO1_1/FC3_RXD_SDA_MOSI/CTIMER0_CAP3/SCT0_GPI5/FC10_RXD_SDA_MOSI/USB1_OVERCURRENTN, identifier: PIS_2,
    direction: INPUT, mode: inactive, invert: disabled, glitch_filter: disabled, slew_rate: standard, open_drain: disabled}
  - {pin_num: K12, peripheral: PINT, signal: 'PINT, 1', pin_signal: PIO1_1/FC3_RXD_SDA_MOSI/CTIMER0_CAP3/SCT0_GPI5/FC10_RXD_SDA_MOSI/USB1_OVERCURRENTN, identifier: PIS_2_INT,
    mode: inactive, invert: disabled, glitch_filter: disabled, slew_rate: standard, open_drain: disabled}
  - {pin_num: N3, peripheral: GPIO, signal: 'PIO1, 0', pin_signal: PIO1_0/FC0_RTS_SCL_SSEL1/SD_D(3)/CTIMER0_CAP2/SCT0_GPI4/TRACECLK/ADC0_6, identifier: PIS_1, direction: INPUT,
    mode: inactive, invert: disabled, glitch_filter: disabled, open_drain: disabled}
  - {pin_num: N3, peripheral: PINT, signal: 'PINT, 0', pin_signal: PIO1_0/FC0_RTS_SCL_SSEL1/SD_D(3)/CTIMER0_CAP2/SCT0_GPI4/TRACECLK/ADC0_6, identifier: PIS_1_INT,
    mode: inactive, invert: disabled, glitch_filter: disabled, open_drain: disabled}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

