pmamatis/NAA-Measurment-Carrier-System/Code/C/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : PIN_INIT_PCIeFunctionPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M4F */
void PIN_INIT_PCIeFunctionPins(void)
{
    /* Enables the clock for the input muxes. 0 = Disable; 1 = Enable.: 0x01u */
    CLOCK_EnableClock(kCLOCK_InputMux);
    /* Enables the clock for the IOCON block. 0 = Disable; 1 = Enable.: 0x01u */
    CLOCK_EnableClock(kCLOCK_Iocon);
    /* Enables the clock for the GPIO1 module */
    CLOCK_EnableClock(kCLOCK_Gpio1);
    /* Enables the clock for the GPIO2 module */
    CLOCK_EnableClock(kCLOCK_Gpio2);
    /* Enables the clock for the GPIO3 module */
    CLOCK_EnableClock(kCLOCK_Gpio3);
    /* Enables the clock for the GPIO4 module */
    CLOCK_EnableClock(kCLOCK_Gpio4);

    gpio_pin_config_t PIS_1_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_0 (pin N3)  */
    GPIO_PinInit(PIN_PCIE_FUNCTION_PIS_1_GPIO, PIN_PCIE_FUNCTION_PIS_1_PORT, PIN_PCIE_FUNCTION_PIS_1_PIN, &PIS_1_config);

    gpio_pin_config_t PIS_2_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_1 (pin K12)  */
    GPIO_PinInit(PIN_PCIE_FUNCTION_PIS_2_GPIO, PIN_PCIE_FUNCTION_PIS_2_PORT, PIN_PCIE_FUNCTION_PIS_2_PIN, &PIS_2_config);

    gpio_pin_config_t PS_12V_2_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_6 (pin G4)  */
    GPIO_PinInit(PIN_PCIE_FUNCTION_PS_12V_2_GPIO, PIN_PCIE_FUNCTION_PS_12V_2_PORT, PIN_PCIE_FUNCTION_PS_12V_2_PIN, &PS_12V_2_config);

    gpio_pin_config_t RST_2_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_7 (pin N1)  */
    GPIO_PinInit(PIN_PCIE_FUNCTION_RST_2_GPIO, PIN_PCIE_FUNCTION_RST_2_PORT, PIN_PCIE_FUNCTION_RST_2_PIN, &RST_2_config);

    gpio_pin_config_t PS_12V_3_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_20 (pin M1)  */
    GPIO_PinInit(PIN_PCIE_FUNCTION_PS_12V_3_GPIO, PIN_PCIE_FUNCTION_PS_12V_3_PORT, PIN_PCIE_FUNCTION_PS_12V_3_PIN, &PS_12V_3_config);

    gpio_pin_config_t PS_3V3_1_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO2_7 (pin J2)  */
    GPIO_PinInit(PIN_PCIE_FUNCTION_PS_3V3_1_GPIO, PIN_PCIE_FUNCTION_PS_3V3_1_PORT, PIN_PCIE_FUNCTION_PS_3V3_1_PIN, &PS_3V3_1_config);

    gpio_pin_config_t PS_12V_4_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO2_8 (pin F4)  */
    GPIO_PinInit(PIN_PCIE_FUNCTION_PS_12V_4_GPIO, PIN_PCIE_FUNCTION_PS_12V_4_PORT, PIN_PCIE_FUNCTION_PS_12V_4_PIN, &PS_12V_4_config);

    gpio_pin_config_t PS_AUX_2_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_13 (pin H4)  */
    GPIO_PinInit(PIN_PCIE_FUNCTION_PS_AUX_2_GPIO, PIN_PCIE_FUNCTION_PS_AUX_2_PORT, PIN_PCIE_FUNCTION_PS_AUX_2_PIN, &PS_AUX_2_config);

    gpio_pin_config_t PS_3V3_2_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_17 (pin K1)  */
    GPIO_PinInit(PIN_PCIE_FUNCTION_PS_3V3_2_GPIO, PIN_PCIE_FUNCTION_PS_3V3_2_PORT, PIN_PCIE_FUNCTION_PS_3V3_2_PIN, &PS_3V3_2_config);

    gpio_pin_config_t RST_1_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_25 (pin P9)  */
    GPIO_PinInit(PIN_PCIE_FUNCTION_RST_1_GPIO, PIN_PCIE_FUNCTION_RST_1_PORT, PIN_PCIE_FUNCTION_RST_1_PIN, &RST_1_config);

    gpio_pin_config_t PS_AUX_1_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_26 (pin K5)  */
    GPIO_PinInit(PIN_PCIE_FUNCTION_PS_AUX_1_GPIO, PIN_PCIE_FUNCTION_PS_AUX_1_PORT, PIN_PCIE_FUNCTION_PS_AUX_1_PIN, &PS_AUX_1_config);

    gpio_pin_config_t PS_12V_1_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO4_4 (pin D9)  */
    GPIO_PinInit(PIN_PCIE_FUNCTION_PS_12V_1_GPIO, PIN_PCIE_FUNCTION_PS_12V_1_PORT, PIN_PCIE_FUNCTION_PS_12V_1_PIN, &PS_12V_1_config);
    /* PIO1_0 is selected for PINT input 0 */
    INPUTMUX_AttachSignal(INPUTMUX, 0U, kINPUTMUX_GpioPort1Pin0ToPintsel);
    /* PIO1_1 is selected for PINT input 1 */
    INPUTMUX_AttachSignal(INPUTMUX, 1U, kINPUTMUX_GpioPort1Pin1ToPintsel);

    const uint32_t PIS_1 = (/* Pin is configured as PIO1_0 */
                            IOCON_PIO_FUNC0 |
                            /* No addition pin function */
                            IOCON_PIO_MODE_INACT |
                            /* Disable analog Mode */
                            IOCON_PIO_ANAMODE_DI |
                            /* Input function is not inverted */
                            IOCON_PIO_INV_DI |
                            /* Enables digital function */
                            IOCON_PIO_DIGITAL_EN |
                            /* Input filter disabled */
                            IOCON_PIO_INPFILT_OFF |
                            /* Open drain is disabled */
                            IOCON_PIO_OPENDRAIN_DI);
    /* PORT1 PIN0 (coords: N3) is configured as PIO1_0 */
    IOCON_PinMuxSet(IOCON, PIN_PCIE_FUNCTION_PIS_1_PORT, PIN_PCIE_FUNCTION_PIS_1_PIN, PIS_1);

    const uint32_t PIS_2 = (/* Pin is configured as PIO1_1 */
                            IOCON_PIO_FUNC0 |
                            /* No addition pin function */
                            IOCON_PIO_MODE_INACT |
                            /* Input function is not inverted */
                            IOCON_PIO_INV_DI |
                            /* Enables digital function */
                            IOCON_PIO_DIGITAL_EN |
                            /* Input filter disabled */
                            IOCON_PIO_INPFILT_OFF |
                            /* Standard mode, output slew rate control is enabled */
                            IOCON_PIO_SLEW_STANDARD |
                            /* Open drain is disabled */
                            IOCON_PIO_OPENDRAIN_DI);
    /* PORT1 PIN1 (coords: K12) is configured as PIO1_1 */
    IOCON_PinMuxSet(IOCON, PIN_PCIE_FUNCTION_PIS_2_PORT, PIN_PCIE_FUNCTION_PIS_2_PIN, PIS_2);

