pmamatis/NAA-Measurment-Carrier-System/Code/C/board/pin_mux.c
    const uint32_t PS_12V_3 = (/* Pin is configured as PIO1_20 */
                               IOCON_PIO_FUNC0 |
                               /* No addition pin function */
                               IOCON_PIO_MODE_INACT |
                               /* Input function is not inverted */
                               IOCON_PIO_INV_DI |
                               /* Enables digital function */
                               IOCON_PIO_DIGITAL_EN |
                               /* Input filter disabled */
                               IOCON_PIO_INPFILT_OFF |
                               /* Standard mode, output slew rate control is enabled */
                               IOCON_PIO_SLEW_STANDARD |
                               /* Open drain is disabled */
                               IOCON_PIO_OPENDRAIN_DI);
    /* PORT1 PIN20 (coords: M1) is configured as PIO1_20 */
    IOCON_PinMuxSet(IOCON, PIN_PCIE_FUNCTION_PS_12V_3_PORT, PIN_PCIE_FUNCTION_PS_12V_3_PIN, PS_12V_3);

    const uint32_t PS_12V_2 = (/* Pin is configured as PIO1_6 */
                               IOCON_PIO_FUNC0 |
                               /* No addition pin function */
                               IOCON_PIO_MODE_INACT |
                               /* Input function is not inverted */
                               IOCON_PIO_INV_DI |
                               /* Enables digital function */
                               IOCON_PIO_DIGITAL_EN |
                               /* Input filter disabled */
                               IOCON_PIO_INPFILT_OFF |
                               /* Standard mode, output slew rate control is enabled */
                               IOCON_PIO_SLEW_STANDARD |
                               /* Open drain is disabled */
                               IOCON_PIO_OPENDRAIN_DI);
    /* PORT1 PIN6 (coords: G4) is configured as PIO1_6 */
    IOCON_PinMuxSet(IOCON, PIN_PCIE_FUNCTION_PS_12V_2_PORT, PIN_PCIE_FUNCTION_PS_12V_2_PIN, PS_12V_2);

    const uint32_t RST_2 = (/* Pin is configured as PIO1_7 */
                            IOCON_PIO_FUNC0 |
                            /* No addition pin function */
                            IOCON_PIO_MODE_INACT |
                            /* Input function is not inverted */
                            IOCON_PIO_INV_DI |
                            /* Enables digital function */
                            IOCON_PIO_DIGITAL_EN |
                            /* Input filter disabled */
                            IOCON_PIO_INPFILT_OFF |
                            /* Standard mode, output slew rate control is enabled */
                            IOCON_PIO_SLEW_STANDARD |
                            /* Open drain is disabled */
                            IOCON_PIO_OPENDRAIN_DI);
    /* PORT1 PIN7 (coords: N1) is configured as PIO1_7 */
    IOCON_PinMuxSet(IOCON, PIN_PCIE_FUNCTION_RST_2_PORT, PIN_PCIE_FUNCTION_RST_2_PIN, RST_2);

    const uint32_t PS_3V3_1 = (/* Pin is configured as PIO2_7 */
                               IOCON_PIO_FUNC0 |
                               /* No addition pin function */
                               IOCON_PIO_MODE_INACT |
                               /* Input function is not inverted */
                               IOCON_PIO_INV_DI |
                               /* Enables digital function */
                               IOCON_PIO_DIGITAL_EN |
                               /* Input filter disabled */
                               IOCON_PIO_INPFILT_OFF |
                               /* Standard mode, output slew rate control is enabled */
                               IOCON_PIO_SLEW_STANDARD |
                               /* Open drain is disabled */
                               IOCON_PIO_OPENDRAIN_DI);
    /* PORT2 PIN7 (coords: J2) is configured as PIO2_7 */
    IOCON_PinMuxSet(IOCON, PIN_PCIE_FUNCTION_PS_3V3_1_PORT, PIN_PCIE_FUNCTION_PS_3V3_1_PIN, PS_3V3_1);

    const uint32_t PS_12V_4 = (/* Pin is configured as PIO2_8 */
                               IOCON_PIO_FUNC0 |
                               /* No addition pin function */
                               IOCON_PIO_MODE_INACT |
                               /* Input function is not inverted */
                               IOCON_PIO_INV_DI |
                               /* Enables digital function */
                               IOCON_PIO_DIGITAL_EN |
                               /* Input filter disabled */
                               IOCON_PIO_INPFILT_OFF |
                               /* Standard mode, output slew rate control is enabled */
                               IOCON_PIO_SLEW_STANDARD |
                               /* Open drain is disabled */
                               IOCON_PIO_OPENDRAIN_DI);
    /* PORT2 PIN8 (coords: F4) is configured as PIO2_8 */
    IOCON_PinMuxSet(IOCON, PIN_PCIE_FUNCTION_PS_12V_4_PORT, PIN_PCIE_FUNCTION_PS_12V_4_PIN, PS_12V_4);

    const uint32_t PS_AUX_2 = (/* Pin is configured as PIO3_13 */
                               IOCON_PIO_FUNC0 |
                               /* No addition pin function */
                               IOCON_PIO_MODE_INACT |
                               /* Input function is not inverted */
                               IOCON_PIO_INV_DI |
                               /* Enables digital function */
                               IOCON_PIO_DIGITAL_EN |
                               /* Input filter disabled */
                               IOCON_PIO_INPFILT_OFF |
                               /* Standard mode, output slew rate control is enabled */
                               IOCON_PIO_SLEW_STANDARD |
                               /* Open drain is disabled */
                               IOCON_PIO_OPENDRAIN_DI);
    /* PORT3 PIN13 (coords: H4) is configured as PIO3_13 */
    IOCON_PinMuxSet(IOCON, PIN_PCIE_FUNCTION_PS_AUX_2_PORT, PIN_PCIE_FUNCTION_PS_AUX_2_PIN, PS_AUX_2);

    const uint32_t PS_3V3_2 = (/* Pin is configured as PIO3_17 */
                               IOCON_PIO_FUNC0 |
                               /* No addition pin function */
                               IOCON_PIO_MODE_INACT |
                               /* Input function is not inverted */
                               IOCON_PIO_INV_DI |
                               /* Enables digital function */
                               IOCON_PIO_DIGITAL_EN |
                               /* Input filter disabled */
                               IOCON_PIO_INPFILT_OFF |
                               /* Standard mode, output slew rate control is enabled */
                               IOCON_PIO_SLEW_STANDARD |
                               /* Open drain is disabled */
                               IOCON_PIO_OPENDRAIN_DI);
    /* PORT3 PIN17 (coords: K1) is configured as PIO3_17 */
    IOCON_PinMuxSet(IOCON, PIN_PCIE_FUNCTION_PS_3V3_2_PORT, PIN_PCIE_FUNCTION_PS_3V3_2_PIN, PS_3V3_2);

    const uint32_t RST_1 = (/* Pin is configured as PIO3_25 */
                            IOCON_PIO_FUNC0 |
                            /* No addition pin function */
                            IOCON_PIO_MODE_INACT |
                            /* Input function is not inverted */
                            IOCON_PIO_INV_DI |
                            /* Enables digital function */
                            IOCON_PIO_DIGITAL_EN |
                            /* Input filter disabled */
                            IOCON_PIO_INPFILT_OFF |
                            /* Standard mode, output slew rate control is enabled */
                            IOCON_PIO_SLEW_STANDARD |
                            /* Open drain is disabled */
                            IOCON_PIO_OPENDRAIN_DI);
    /* PORT3 PIN25 (coords: P9) is configured as PIO3_25 */
    IOCON_PinMuxSet(IOCON, PIN_PCIE_FUNCTION_RST_1_PORT, PIN_PCIE_FUNCTION_RST_1_PIN, RST_1);

    const uint32_t PS_AUX_1 = (/* Pin is configured as PIO3_26 */
                               IOCON_PIO_FUNC0 |
                               /* No addition pin function */
                               IOCON_PIO_MODE_INACT |
                               /* Input function is not inverted */
                               IOCON_PIO_INV_DI |
                               /* Enables digital function */
                               IOCON_PIO_DIGITAL_EN |
                               /* Input filter disabled */
                               IOCON_PIO_INPFILT_OFF |
                               /* Standard mode, output slew rate control is enabled */
                               IOCON_PIO_SLEW_STANDARD |
                               /* Open drain is disabled */
                               IOCON_PIO_OPENDRAIN_DI);
    /* PORT3 PIN26 (coords: K5) is configured as PIO3_26 */
    IOCON_PinMuxSet(IOCON, PIN_PCIE_FUNCTION_PS_AUX_1_PORT, PIN_PCIE_FUNCTION_PS_AUX_1_PIN, PS_AUX_1);

