pmamatis/NAA-Measurment-Carrier-System/Code/C/board/pin_mux.c
    const uint32_t PS_12V_1 = (/* Pin is configured as PIO4_4 */
                               IOCON_PIO_FUNC0 |
                               /* No addition pin function */
                               IOCON_PIO_MODE_INACT |
                               /* Input function is not inverted */
                               IOCON_PIO_INV_DI |
                               /* Enables digital function */
                               IOCON_PIO_DIGITAL_EN |
                               /* Input filter disabled */
                               IOCON_PIO_INPFILT_OFF |
                               /* Standard mode, output slew rate control is enabled */
                               IOCON_PIO_SLEW_STANDARD |
                               /* Open drain is disabled */
                               IOCON_PIO_OPENDRAIN_DI);
    /* PORT4 PIN4 (coords: D9) is configured as PIO4_4 */
    IOCON_PinMuxSet(IOCON, PIN_PCIE_FUNCTION_PS_12V_1_PORT, PIN_PCIE_FUNCTION_PS_12V_1_PIN, PS_12V_1);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
PIN_INIT_LEDs:
- options: {callFromInitBoot: 'false', prefix: PIN_USRLED_, coreID: core0, enableClock: 'true', fullInit: 'true'}
- pin_list:
  - {pin_num: N12, peripheral: GPIO, signal: 'PIO1, 17', pin_signal: PIO1_17/ENET_MDIO/FC8_RXD_SDA_MOSI/SCT0_OUT4/CAN1_TD/EMC_BLSN(0), direction: OUTPUT, gpio_init_state: 'false',
    mode: inactive, invert: disabled, glitch_filter: disabled, slew_rate: standard, open_drain: disabled}
  - {pin_num: P12, peripheral: GPIO, signal: 'PIO2, 19', pin_signal: PIO2_19/LCD_VD(1)/FC3_TXD_SCL_MISO/FC7_RXD_SDA_MOSI_DATA/CTIMER3_MAT1, direction: OUTPUT, gpio_init_state: 'false',
    mode: inactive, invert: disabled, glitch_filter: disabled, slew_rate: standard, open_drain: disabled}
  - {pin_num: P14, peripheral: GPIO, signal: 'PIO3, 27', pin_signal: PIO3_27/SCT0_OUT1/FC4_TXD_SCL_MISO/EMC_A(16), direction: OUTPUT, gpio_init_state: 'false', mode: inactive,
    invert: disabled, glitch_filter: disabled, slew_rate: standard, open_drain: disabled}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : PIN_INIT_LEDs
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M4F */
void PIN_INIT_LEDs(void)
{
    /* Enables the clock for the IOCON block. 0 = Disable; 1 = Enable.: 0x01u */
    CLOCK_EnableClock(kCLOCK_Iocon);
    /* Enables the clock for the GPIO1 module */
    CLOCK_EnableClock(kCLOCK_Gpio1);
    /* Enables the clock for the GPIO2 module */
    CLOCK_EnableClock(kCLOCK_Gpio2);
    /* Enables the clock for the GPIO3 module */
    CLOCK_EnableClock(kCLOCK_Gpio3);

    gpio_pin_config_t DebugLED_1_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_17 (pin N12)  */
    GPIO_PinInit(PIN_USRLED_DebugLED_1_GPIO, PIN_USRLED_DebugLED_1_PORT, PIN_USRLED_DebugLED_1_PIN, &DebugLED_1_config);

    gpio_pin_config_t DebugLED_2_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO2_19 (pin P12)  */
    GPIO_PinInit(PIN_USRLED_DebugLED_2_GPIO, PIN_USRLED_DebugLED_2_PORT, PIN_USRLED_DebugLED_2_PIN, &DebugLED_2_config);

    gpio_pin_config_t DebugLED_0_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_27 (pin P14)  */
    GPIO_PinInit(PIN_USRLED_DebugLED_0_GPIO, PIN_USRLED_DebugLED_0_PORT, PIN_USRLED_DebugLED_0_PIN, &DebugLED_0_config);

    const uint32_t DebugLED_1 = (/* Pin is configured as PIO1_17 */
                                 IOCON_PIO_FUNC0 |
                                 /* No addition pin function */
                                 IOCON_PIO_MODE_INACT |
                                 /* Input function is not inverted */
                                 IOCON_PIO_INV_DI |
                                 /* Enables digital function */
                                 IOCON_PIO_DIGITAL_EN |
                                 /* Input filter disabled */
                                 IOCON_PIO_INPFILT_OFF |
                                 /* Standard mode, output slew rate control is enabled */
                                 IOCON_PIO_SLEW_STANDARD |
                                 /* Open drain is disabled */
                                 IOCON_PIO_OPENDRAIN_DI);
    /* PORT1 PIN17 (coords: N12) is configured as PIO1_17 */
    IOCON_PinMuxSet(IOCON, PIN_USRLED_DebugLED_1_PORT, PIN_USRLED_DebugLED_1_PIN, DebugLED_1);

    const uint32_t DebugLED_2 = (/* Pin is configured as PIO2_19 */
                                 IOCON_PIO_FUNC0 |
                                 /* No addition pin function */
                                 IOCON_PIO_MODE_INACT |
                                 /* Input function is not inverted */
                                 IOCON_PIO_INV_DI |
                                 /* Enables digital function */
                                 IOCON_PIO_DIGITAL_EN |
                                 /* Input filter disabled */
                                 IOCON_PIO_INPFILT_OFF |
                                 /* Standard mode, output slew rate control is enabled */
                                 IOCON_PIO_SLEW_STANDARD |
                                 /* Open drain is disabled */
                                 IOCON_PIO_OPENDRAIN_DI);
    /* PORT2 PIN19 (coords: P12) is configured as PIO2_19 */
    IOCON_PinMuxSet(IOCON, PIN_USRLED_DebugLED_2_PORT, PIN_USRLED_DebugLED_2_PIN, DebugLED_2);

    const uint32_t DebugLED_0 = (/* Pin is configured as PIO3_27 */
                                 IOCON_PIO_FUNC0 |
                                 /* No addition pin function */
                                 IOCON_PIO_MODE_INACT |
                                 /* Input function is not inverted */
                                 IOCON_PIO_INV_DI |
                                 /* Enables digital function */
                                 IOCON_PIO_DIGITAL_EN |
                                 /* Input filter disabled */
                                 IOCON_PIO_INPFILT_OFF |
                                 /* Standard mode, output slew rate control is enabled */
                                 IOCON_PIO_SLEW_STANDARD |
                                 /* Open drain is disabled */
                                 IOCON_PIO_OPENDRAIN_DI);
    /* PORT3 PIN27 (coords: P14) is configured as PIO3_27 */
    IOCON_PinMuxSet(IOCON, PIN_USRLED_DebugLED_0_PORT, PIN_USRLED_DebugLED_0_PIN, DebugLED_0);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
PIN_INIT_DEBUG_UARTPins:
- options: {createDeInit: 'true', callFromInitBoot: 'false', prefix: PIN_UART, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: P13, peripheral: FLEXCOMM7, signal: TXD_SCL_MISO_WS, pin_signal: PIO2_20/LCD_VD(2)/FC3_RTS_SCL_SSEL1/FC7_TXD_SCL_MISO_WS/CTIMER3_MAT2/CTIMER4_CAP0}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

