pmamatis/NAA-Measurment-Carrier-System/Code/C/board/pin_mux.c
    const uint32_t ENET_RXD0 = (/* Pin is configured as ENET_RXD0 */
                                IOCON_PIO_FUNC1 |
                                /* No addition pin function */
                                IOCON_PIO_MODE_INACT |
                                /* Input function is not inverted */
                                IOCON_PIO_INV_DI |
                                /* Enables digital function */
                                IOCON_PIO_DIGITAL_EN |
                                /* Input filter disabled */
                                IOCON_PIO_INPFILT_OFF |
                                /* Standard mode, output slew rate control is enabled */
                                IOCON_PIO_SLEW_STANDARD |
                                /* Open drain is disabled */
                                IOCON_PIO_OPENDRAIN_DI);
    /* PORT4 PIN11 (coords: A9) is configured as ENET_RXD0 */
    IOCON_PinMuxSet(IOCON, PIN_ENET_ENET_RXD0_PORT, PIN_ENET_ENET_RXD0_PIN, ENET_RXD0);

    const uint32_t ENET_RXD1 = (/* Pin is configured as ENET_RXD1 */
                                IOCON_PIO_FUNC1 |
                                /* No addition pin function */
                                IOCON_PIO_MODE_INACT |
                                /* Input function is not inverted */
                                IOCON_PIO_INV_DI |
                                /* Enables digital function */
                                IOCON_PIO_DIGITAL_EN |
                                /* Input filter disabled */
                                IOCON_PIO_INPFILT_OFF |
                                /* Standard mode, output slew rate control is enabled */
                                IOCON_PIO_SLEW_STANDARD |
                                /* Open drain is disabled */
                                IOCON_PIO_OPENDRAIN_DI);
    /* PORT4 PIN12 (coords: A6) is configured as ENET_RXD1 */
    IOCON_PinMuxSet(IOCON, PIN_ENET_ENET_RXD1_PORT, PIN_ENET_ENET_RXD1_PIN, ENET_RXD1);

    const uint32_t ENET_TX_EN = (/* Pin is configured as ENET_TX_EN */
                                 IOCON_PIO_FUNC1 |
                                 /* No addition pin function */
                                 IOCON_PIO_MODE_INACT |
                                 /* Input function is not inverted */
                                 IOCON_PIO_INV_DI |
                                 /* Enables digital function */
                                 IOCON_PIO_DIGITAL_EN |
                                 /* Input filter disabled */
                                 IOCON_PIO_INPFILT_OFF |
                                 /* Standard mode, output slew rate control is enabled */
                                 IOCON_PIO_SLEW_STANDARD |
                                 /* Open drain is disabled */
                                 IOCON_PIO_OPENDRAIN_DI);
    /* PORT4 PIN13 (coords: B6) is configured as ENET_TX_EN */
    IOCON_PinMuxSet(IOCON, PIN_ENET_ENET_TX_EN_PORT, PIN_ENET_ENET_TX_EN_PIN, ENET_TX_EN);

    const uint32_t ENET_RX_CLK = (/* Pin is configured as ENET_RX_CLK */
                                  IOCON_PIO_FUNC1 |
                                  /* No addition pin function */
                                  IOCON_PIO_MODE_INACT |
                                  /* Input function is not inverted */
                                  IOCON_PIO_INV_DI |
                                  /* Enables digital function */
                                  IOCON_PIO_DIGITAL_EN |
                                  /* Input filter disabled */
                                  IOCON_PIO_INPFILT_OFF |
                                  /* Standard mode, output slew rate control is enabled */
                                  IOCON_PIO_SLEW_STANDARD |
                                  /* Open drain is disabled */
                                  IOCON_PIO_OPENDRAIN_DI);
    /* PORT4 PIN14 (coords: B5) is configured as ENET_RX_CLK */
    IOCON_PinMuxSet(IOCON, PIN_ENET_ENET_RX_CLK_PORT, PIN_ENET_ENET_RX_CLK_PIN, ENET_RX_CLK);

    const uint32_t ENET_MDC = (/* Pin is configured as ENET_MDC */
                               IOCON_PIO_FUNC1 |
                               /* No addition pin function */
                               IOCON_PIO_MODE_INACT |
                               /* Input function is not inverted */
                               IOCON_PIO_INV_DI |
                               /* Enables digital function */
                               IOCON_PIO_DIGITAL_EN |
                               /* Input filter disabled */
                               IOCON_PIO_INPFILT_OFF |
                               /* Standard mode, output slew rate control is enabled */
                               IOCON_PIO_SLEW_STANDARD |
                               /* Open drain is disabled */
                               IOCON_PIO_OPENDRAIN_DI);
    /* PORT4 PIN15 (coords: A4) is configured as ENET_MDC */
    IOCON_PinMuxSet(IOCON, PIN_ENET_ENET_MDC_PORT, PIN_ENET_ENET_MDC_PIN, ENET_MDC);

    const uint32_t ENET_MDIO = (/* Pin is configured as ENET_MDIO */
                                IOCON_PIO_FUNC1 |
                                /* No addition pin function */
                                IOCON_PIO_MODE_INACT |
                                /* Input function is not inverted */
                                IOCON_PIO_INV_DI |
                                /* Enables digital function */
                                IOCON_PIO_DIGITAL_EN |
                                /* Input filter disabled */
                                IOCON_PIO_INPFILT_OFF |
                                /* Standard mode, output slew rate control is enabled */
                                IOCON_PIO_SLEW_STANDARD |
                                /* Open drain is disabled */
                                IOCON_PIO_OPENDRAIN_DI);
    /* PORT4 PIN16 (coords: C4) is configured as ENET_MDIO */
    IOCON_PinMuxSet(IOCON, PIN_ENET_ENET_MDIO_PORT, PIN_ENET_ENET_MDIO_PIN, ENET_MDIO);

    const uint32_t ENET_TXD0 = (/* Pin is configured as ENET_TXD0 */
                                IOCON_PIO_FUNC1 |
                                /* No addition pin function */
                                IOCON_PIO_MODE_INACT |
                                /* Input function is not inverted */
                                IOCON_PIO_INV_DI |
                                /* Enables digital function */
                                IOCON_PIO_DIGITAL_EN |
                                /* Input filter disabled */
                                IOCON_PIO_INPFILT_OFF |
                                /* Standard mode, output slew rate control is enabled */
                                IOCON_PIO_SLEW_STANDARD |
                                /* Open drain is disabled */
                                IOCON_PIO_OPENDRAIN_DI);
    /* PORT4 PIN8 (coords: B14) is configured as ENET_TXD0 */
    IOCON_PinMuxSet(IOCON, PIN_ENET_ENET_TXD0_PORT, PIN_ENET_ENET_TXD0_PIN, ENET_TXD0);
}


