pmamatis/NAA-Measurment-Carrier-System/Code/C/board/pin_mux.c
    IOCON->PIO[1][22] = ((IOCON->PIO[1][22] &
                          /* Mask bits to zero which are setting */
                          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK | IOCON_PIO_SLEW_MASK | IOCON_PIO_OD_MASK)))

                         /* Selects pin function.
                          * : PORT122 (pin P11) is configured as FC8_RTS_SCL_SSEL1. */
                         | IOCON_PIO_FUNC(PIO122_FUNC_ALT1)

                         /* Select Analog/Digital mode.
                          * : Digital mode. */
                         | IOCON_PIO_DIGIMODE(PIO122_DIGIMODE_DIGITAL)

                         /* Driver slew rate.
                          * : Fast mode, slew rate control is disabled.
                          * Refer to the appropriate specific device data sheet for details. */
                         | IOCON_PIO_SLEW(PIO122_SLEW_FAST)

                         /* Controls open-drain mode.
                          * : Normal.
                          * Normal push-pull output. */
                         | IOCON_PIO_OD(PIO122_OD_NORMAL));

    IOCON->PIO[2][17] = ((IOCON->PIO[2][17] &
                          /* Mask bits to zero which are setting */
                          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK | IOCON_PIO_SLEW_MASK | IOCON_PIO_OD_MASK)))

                         /* Selects pin function.
                          * : PORT217 (pin P10) is configured as FC8_RXD_SDA_MOSI. */
                         | IOCON_PIO_FUNC(PIO217_FUNC_ALT5)

                         /* Select Analog/Digital mode.
                          * : Digital mode. */
                         | IOCON_PIO_DIGIMODE(PIO217_DIGIMODE_DIGITAL)

                         /* Driver slew rate.
                          * : Fast mode, slew rate control is disabled.
                          * Refer to the appropriate specific device data sheet for details. */
                         | IOCON_PIO_SLEW(PIO217_SLEW_FAST)

                         /* Controls open-drain mode.
                          * : Normal.
                          * Normal push-pull output. */
                         | IOCON_PIO_OD(PIO217_OD_NORMAL));

    IOCON->PIO[3][21] =
        ((IOCON->PIO[3][21] &
          /* Mask bits to zero which are setting */
          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_MODE_MASK | IOCON_PIO_ANAMODE_MASK | IOCON_PIO_DIGIMODE_MASK | IOCON_PIO_FILTEROFF_MASK)))

         /* Selects pin function.
          * : PORT321 (pin P5) is configured as FC9_RXD_SDA_MOSI. */
         | IOCON_PIO_FUNC(PIO321_FUNC_ALT1)

         /* Selects function mode (on-chip pull-up/pull-down resistor control).
          * : Inactive.
          * Inactive (no pull-down/pull-up resistor enabled). */
         | IOCON_PIO_MODE(PIO321_MODE_INACTIVE)

         /* Enables or disables analog mode.
          * : Disable analog Mode. */
         | IOCON_PIO_ANAMODE(PIO321_ANAMODE_DISABLED)

         /* Select Analog/Digital mode.
          * : Digital mode. */
         | IOCON_PIO_DIGIMODE(PIO321_DIGIMODE_DIGITAL)

         /* Controls input glitch filter.
          * : Filter enabled.
          * Noise pulses below approximately 10 ns are filtered out. */
         | IOCON_PIO_FILTEROFF(PIO321_FILTEROFF_ENABLED));

    IOCON->PIO[3][22] =
        ((IOCON->PIO[3][22] &
          /* Mask bits to zero which are setting */
          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_MODE_MASK | IOCON_PIO_ANAMODE_MASK | IOCON_PIO_DIGIMODE_MASK | IOCON_PIO_FILTEROFF_MASK)))

         /* Selects pin function.
          * : PORT322 (pin N5) is configured as FC9_TXD_SCL_MISO. */
         | IOCON_PIO_FUNC(PIO322_FUNC_ALT1)

         /* Selects function mode (on-chip pull-up/pull-down resistor control).
          * : Inactive.
          * Inactive (no pull-down/pull-up resistor enabled). */
         | IOCON_PIO_MODE(PIO322_MODE_INACTIVE)

         /* Enables or disables analog mode.
          * : Disable analog Mode. */
         | IOCON_PIO_ANAMODE(PIO322_ANAMODE_DISABLED)

         /* Select Analog/Digital mode.
          * : Digital mode. */
         | IOCON_PIO_DIGIMODE(PIO322_DIGIMODE_DIGITAL)

         /* Controls input glitch filter.
          * : Filter enabled.
          * Noise pulses below approximately 10 ns are filtered out. */
         | IOCON_PIO_FILTEROFF(PIO322_FILTEROFF_ENABLED));

    IOCON->PIO[3][23] = ((IOCON->PIO[3][23] &
                          /* Mask bits to zero which are setting */
                          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_I2CSLEW_MASK | IOCON_PIO_DIGIMODE_MASK)))

                         /* Selects pin function.
                          * : PORT323 (pin C2) is configured as FC2_CTS_SDA_SSEL0. */
                         | IOCON_PIO_FUNC(PIO323_FUNC_ALT1)

                         /* Controls slew rate of I2C pad.
                          * : I2C mode. */
                         | IOCON_PIO_I2CSLEW(PIO323_I2CSLEW_I2C_MODE)

                         /* Select Analog/Digital mode.
                          * : Digital mode. */
                         | IOCON_PIO_DIGIMODE(PIO323_DIGIMODE_DIGITAL));

    IOCON->PIO[3][24] = ((IOCON->PIO[3][24] &
                          /* Mask bits to zero which are setting */
                          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_I2CSLEW_MASK | IOCON_PIO_DIGIMODE_MASK)))

                         /* Selects pin function.
                          * : PORT324 (pin E2) is configured as FC2_RTS_SCL_SSEL1. */
                         | IOCON_PIO_FUNC(PIO324_FUNC_ALT1)

                         /* Controls slew rate of I2C pad.
                          * : I2C mode. */
                         | IOCON_PIO_I2CSLEW(PIO324_I2CSLEW_I2C_MODE)

                         /* Select Analog/Digital mode.
                          * : Digital mode. */
                         | IOCON_PIO_DIGIMODE(PIO324_DIGIMODE_DIGITAL));

    IOCON->PIO[4][2] = ((IOCON->PIO[4][2] &
                         /* Mask bits to zero which are setting */
                         (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK | IOCON_PIO_SLEW_MASK)))

                        /* Selects pin function.
                         * : PORT42 (pin F14) is configured as FC6_RXD_SDA_MOSI_DATA. */
                        | IOCON_PIO_FUNC(PIO42_FUNC_ALT2)

                        /* Select Analog/Digital mode.
                         * : Digital mode. */
                        | IOCON_PIO_DIGIMODE(PIO42_DIGIMODE_DIGITAL)

                        /* Driver slew rate.
                         * : Fast mode, slew rate control is disabled.
                         * Refer to the appropriate specific device data sheet for details. */
                        | IOCON_PIO_SLEW(PIO42_SLEW_FAST));

    IOCON->PIO[4][3] = ((IOCON->PIO[4][3] &
                         /* Mask bits to zero which are setting */
                         (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK | IOCON_PIO_SLEW_MASK)))

                        /* Selects pin function.
                         * : PORT43 (pin F13) is configured as FC6_TXD_SCL_MISO_WS. */
                        | IOCON_PIO_FUNC(PIO43_FUNC_ALT2)

                        /* Select Analog/Digital mode.
                         * : Digital mode. */
                        | IOCON_PIO_DIGIMODE(PIO43_DIGIMODE_DIGITAL)

                        /* Driver slew rate.
                         * : Fast mode, slew rate control is disabled.
                         * Refer to the appropriate specific device data sheet for details. */
                        | IOCON_PIO_SLEW(PIO43_SLEW_FAST));
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
PIN_INIT_PcieJTAGPins:
- options: {createDeInit: 'true', callFromInitBoot: 'false', prefix: PINS_JTAG_, coreID: core0, enableClock: 'true', fullInit: 'true'}
- pin_list:
  - {pin_num: N2, peripheral: SYSCON, signal: CLKOUT, pin_signal: PIO3_20/FC9_SCK/SD_CARD_INT_N/CLKOUT/SCT0_OUT7, mode: inactive, invert: disabled, glitch_filter: disabled,
    slew_rate: standard, open_drain: disabled}
  - {pin_num: P7, peripheral: GPIO, signal: 'PIO2, 13', pin_signal: PIO2_13/LCD_DCLK/SD_VOLT(2)/FC5_TXD_SCL_MISO, direction: INPUT, mode: inactive, invert: disabled,
    glitch_filter: disabled, slew_rate: standard, open_drain: disabled}
  - {pin_num: P4, peripheral: GPIO, signal: 'PIO2, 1', pin_signal: PIO2_1/FC0_TXD_SCL_MISO/CTIMER1_MAT0/ADC0_8, direction: OUTPUT, gpio_init_state: 'false', mode: inactive,
    invert: disabled, glitch_filter: disabled, open_drain: disabled}
  - {pin_num: P1, peripheral: GPIO, signal: 'PIO2, 10', pin_signal: PIO2_10/ENET_RX_ER/SD_CARD_DET_N, direction: INPUT, mode: inactive, invert: disabled, glitch_filter: disabled,
    slew_rate: standard, open_drain: disabled}
  - {pin_num: P3, peripheral: GPIO, signal: 'PIO2, 0', pin_signal: PIO2_0/FC0_RXD_SDA_MOSI/CTIMER1_CAP0/ADC0_7, direction: OUTPUT, gpio_init_state: 'false', mode: inactive,
    invert: disabled, glitch_filter: disabled, open_drain: disabled}
  - {pin_num: P8, peripheral: GPIO, signal: 'PIO1, 8', pin_signal: PIO1_8/FC0_CTS_SDA_SSEL0/SD_CLK/SCT0_OUT1/FC4_SSEL2/EMC_A(7), direction: OUTPUT, gpio_init_state: 'false',
    mode: inactive, invert: disabled, glitch_filter: disabled, slew_rate: standard, open_drain: disabled}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

