pmamatis/NAA-Measurment-Carrier-System/Code/C/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : PIN_INIT_PcieJTAGPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M4F */
void PIN_INIT_PcieJTAGPins(void)
{
    /* Enables the clock for the IOCON block. 0 = Disable; 1 = Enable.: 0x01u */
    CLOCK_EnableClock(kCLOCK_Iocon);
    /* Enables the clock for the GPIO1 module */
    CLOCK_EnableClock(kCLOCK_Gpio1);
    /* Enables the clock for the GPIO2 module */
    CLOCK_EnableClock(kCLOCK_Gpio2);

    gpio_pin_config_t JTAG_TDI_1_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_8 (pin P8)  */
    GPIO_PinInit(PINS_JTAG_JTAG_TDI_1_GPIO, PINS_JTAG_JTAG_TDI_1_PORT, PINS_JTAG_JTAG_TDI_1_PIN, &JTAG_TDI_1_config);

    gpio_pin_config_t JTAG_TDI_2_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO2_0 (pin P3)  */
    GPIO_PinInit(PINS_JTAG_JTAG_TDI_2_GPIO, PINS_JTAG_JTAG_TDI_2_PORT, PINS_JTAG_JTAG_TDI_2_PIN, &JTAG_TDI_2_config);

    gpio_pin_config_t JTAG_TMS_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO2_1 (pin P4)  */
    GPIO_PinInit(PINS_JTAG_JTAG_TMS_GPIO, PINS_JTAG_JTAG_TMS_PORT, PINS_JTAG_JTAG_TMS_PIN, &JTAG_TMS_config);

    gpio_pin_config_t JTAG_TDO_2_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO2_10 (pin P1)  */
    GPIO_PinInit(PINS_JTAG_JTAG_TDO_2_GPIO, PINS_JTAG_JTAG_TDO_2_PORT, PINS_JTAG_JTAG_TDO_2_PIN, &JTAG_TDO_2_config);

    gpio_pin_config_t JTAG_TDO_1_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO2_13 (pin P7)  */
    GPIO_PinInit(PINS_JTAG_JTAG_TDO_1_GPIO, PINS_JTAG_JTAG_TDO_1_PORT, PINS_JTAG_JTAG_TDO_1_PIN, &JTAG_TDO_1_config);

    const uint32_t JTAG_TDI_1 = (/* Pin is configured as PIO1_8 */
                                 IOCON_PIO_FUNC0 |
                                 /* No addition pin function */
                                 IOCON_PIO_MODE_INACT |
                                 /* Input function is not inverted */
                                 IOCON_PIO_INV_DI |
                                 /* Enables digital function */
                                 IOCON_PIO_DIGITAL_EN |
                                 /* Input filter disabled */
                                 IOCON_PIO_INPFILT_OFF |
                                 /* Standard mode, output slew rate control is enabled */
                                 IOCON_PIO_SLEW_STANDARD |
                                 /* Open drain is disabled */
                                 IOCON_PIO_OPENDRAIN_DI);
    /* PORT1 PIN8 (coords: P8) is configured as PIO1_8 */
    IOCON_PinMuxSet(IOCON, PINS_JTAG_JTAG_TDI_1_PORT, PINS_JTAG_JTAG_TDI_1_PIN, JTAG_TDI_1);

    const uint32_t JTAG_TDI_2 = (/* Pin is configured as PIO2_0 */
                                 IOCON_PIO_FUNC0 |
                                 /* No addition pin function */
                                 IOCON_PIO_MODE_INACT |
                                 /* Disable analog Mode */
                                 IOCON_PIO_ANAMODE_DI |
                                 /* Input function is not inverted */
                                 IOCON_PIO_INV_DI |
                                 /* Enables digital function */
                                 IOCON_PIO_DIGITAL_EN |
                                 /* Input filter disabled */
                                 IOCON_PIO_INPFILT_OFF |
                                 /* Open drain is disabled */
                                 IOCON_PIO_OPENDRAIN_DI);
    /* PORT2 PIN0 (coords: P3) is configured as PIO2_0 */
    IOCON_PinMuxSet(IOCON, PINS_JTAG_JTAG_TDI_2_PORT, PINS_JTAG_JTAG_TDI_2_PIN, JTAG_TDI_2);

    const uint32_t JTAG_TMS = (/* Pin is configured as PIO2_1 */
                               IOCON_PIO_FUNC0 |
                               /* No addition pin function */
                               IOCON_PIO_MODE_INACT |
                               /* Disable analog Mode */
                               IOCON_PIO_ANAMODE_DI |
                               /* Input function is not inverted */
                               IOCON_PIO_INV_DI |
                               /* Enables digital function */
                               IOCON_PIO_DIGITAL_EN |
                               /* Input filter disabled */
                               IOCON_PIO_INPFILT_OFF |
                               /* Open drain is disabled */
                               IOCON_PIO_OPENDRAIN_DI);
    /* PORT2 PIN1 (coords: P4) is configured as PIO2_1 */
    IOCON_PinMuxSet(IOCON, PINS_JTAG_JTAG_TMS_PORT, PINS_JTAG_JTAG_TMS_PIN, JTAG_TMS);

    const uint32_t JTAG_TDO_2 = (/* Pin is configured as PIO2_10 */
                                 IOCON_PIO_FUNC0 |
                                 /* No addition pin function */
                                 IOCON_PIO_MODE_INACT |
                                 /* Input function is not inverted */
                                 IOCON_PIO_INV_DI |
                                 /* Enables digital function */
                                 IOCON_PIO_DIGITAL_EN |
                                 /* Input filter disabled */
                                 IOCON_PIO_INPFILT_OFF |
                                 /* Standard mode, output slew rate control is enabled */
                                 IOCON_PIO_SLEW_STANDARD |
                                 /* Open drain is disabled */
                                 IOCON_PIO_OPENDRAIN_DI);
    /* PORT2 PIN10 (coords: P1) is configured as PIO2_10 */
    IOCON_PinMuxSet(IOCON, PINS_JTAG_JTAG_TDO_2_PORT, PINS_JTAG_JTAG_TDO_2_PIN, JTAG_TDO_2);

    const uint32_t JTAG_TDO_1 = (/* Pin is configured as PIO2_13 */
                                 IOCON_PIO_FUNC0 |
                                 /* No addition pin function */
                                 IOCON_PIO_MODE_INACT |
                                 /* Input function is not inverted */
                                 IOCON_PIO_INV_DI |
                                 /* Enables digital function */
                                 IOCON_PIO_DIGITAL_EN |
                                 /* Input filter disabled */
                                 IOCON_PIO_INPFILT_OFF |
                                 /* Standard mode, output slew rate control is enabled */
                                 IOCON_PIO_SLEW_STANDARD |
                                 /* Open drain is disabled */
                                 IOCON_PIO_OPENDRAIN_DI);
    /* PORT2 PIN13 (coords: P7) is configured as PIO2_13 */
    IOCON_PinMuxSet(IOCON, PINS_JTAG_JTAG_TDO_1_PORT, PINS_JTAG_JTAG_TDO_1_PIN, JTAG_TDO_1);

