pmamatis/NAA-Measurment-Carrier-System/Code/C/board/pin_mux.c
    const uint32_t JTAG_TCK = (/* Pin is configured as CLKOUT */
                               IOCON_PIO_FUNC3 |
                               /* No addition pin function */
                               IOCON_PIO_MODE_INACT |
                               /* Input function is not inverted */
                               IOCON_PIO_INV_DI |
                               /* Enables digital function */
                               IOCON_PIO_DIGITAL_EN |
                               /* Input filter disabled */
                               IOCON_PIO_INPFILT_OFF |
                               /* Standard mode, output slew rate control is enabled */
                               IOCON_PIO_SLEW_STANDARD |
                               /* Open drain is disabled */
                               IOCON_PIO_OPENDRAIN_DI);
    /* PORT3 PIN20 (coords: N2) is configured as CLKOUT */
    IOCON_PinMuxSet(IOCON, PINS_JTAG_JTAG_TCK_PORT, PINS_JTAG_JTAG_TCK_PIN, JTAG_TCK);
}


/* FUNCTION ************************************************************************************************************
 *
 * Function Name : PIN_INIT_PcieJTAGPins_deinit
 * Description   : This is a de-initialization function for 'PIN_INIT_PcieJTAGPins' function.
 * It sets all pins features (routing, direction and electrical) to their after-reset state.
 * It also tries to route the previous peripheral signals to their default pins.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M4F */
void PIN_INIT_PcieJTAGPins_deinit(void)
{
  /* There are conflicts or other incorrect settings in the configuration, the code below is generated only for 
     those registers which are set correctly and without a conflict. Open this file in Pins Tool for more details. */

    /* Enables the clock for the IOCON block. 0 = Disable; 1 = Enable.: 0x01u */
    CLOCK_EnableClock(kCLOCK_Iocon);

    const uint32_t port1_pin8_config = (/* Pin is disabled */
                                        IOCON_PIO_FUNC0 |
                                        /* No addition pin function */
                                        IOCON_PIO_MODE_INACT |
                                        /* Input function is not inverted */
                                        IOCON_PIO_INV_DI |
                                        /* Enables analog function */
                                        IOCON_PIO_ANALOG_EN |
                                        /* Input filter disabled */
                                        IOCON_PIO_INPFILT_OFF |
                                        /* Standard mode, output slew rate control is enabled */
                                        IOCON_PIO_SLEW_STANDARD |
                                        /* Open drain is disabled */
                                        IOCON_PIO_OPENDRAIN_DI);
    /* PORT18 (pin P8) is disabled */
    IOCON_PinMuxSet(IOCON, 1U, 8U, port1_pin8_config);

    const uint32_t port2_pin0_config = (/* Pin is disabled */
                                        IOCON_PIO_FUNC0 |
                                        /* No addition pin function */
                                        IOCON_PIO_MODE_INACT |
                                        /* Disable analog Mode */
                                        IOCON_PIO_ANAMODE_DI |
                                        /* Input function is not inverted */
                                        IOCON_PIO_INV_DI |
                                        /* Enables analog function */
                                        IOCON_PIO_ANALOG_EN |
                                        /* Input filter disabled */
                                        IOCON_PIO_INPFILT_OFF |
                                        /* Open drain is disabled */
                                        IOCON_PIO_OPENDRAIN_DI);
    /* PORT20 (pin P3) is disabled */
    IOCON_PinMuxSet(IOCON, 2U, 0U, port2_pin0_config);

    const uint32_t port2_pin1_config = (/* Pin is disabled */
                                        IOCON_PIO_FUNC0 |
                                        /* No addition pin function */
                                        IOCON_PIO_MODE_INACT |
                                        /* Disable analog Mode */
                                        IOCON_PIO_ANAMODE_DI |
                                        /* Input function is not inverted */
                                        IOCON_PIO_INV_DI |
                                        /* Enables analog function */
                                        IOCON_PIO_ANALOG_EN |
                                        /* Input filter disabled */
                                        IOCON_PIO_INPFILT_OFF |
                                        /* Open drain is disabled */
                                        IOCON_PIO_OPENDRAIN_DI);
    /* PORT21 (pin P4) is disabled */
    IOCON_PinMuxSet(IOCON, 2U, 1U, port2_pin1_config);

    const uint32_t port2_pin10_config = (/* Pin is disabled */
                                         IOCON_PIO_FUNC0 |
                                         /* No addition pin function */
                                         IOCON_PIO_MODE_INACT |
                                         /* Input function is not inverted */
                                         IOCON_PIO_INV_DI |
                                         /* Enables analog function */
                                         IOCON_PIO_ANALOG_EN |
                                         /* Input filter disabled */
                                         IOCON_PIO_INPFILT_OFF |
                                         /* Standard mode, output slew rate control is enabled */
                                         IOCON_PIO_SLEW_STANDARD |
                                         /* Open drain is disabled */
                                         IOCON_PIO_OPENDRAIN_DI);
    /* PORT210 (pin P1) is disabled */
    IOCON_PinMuxSet(IOCON, 2U, 10U, port2_pin10_config);

