pmamatis/NAA-Measurment-Carrier-System/Code/C/board/pin_mux.c
    const uint32_t ISP_FC0_TXD = (/* Pin is configured as FC0_TXD_SCL_MISO */
                                  IOCON_PIO_FUNC1 |
                                  /* No addition pin function */
                                  IOCON_PIO_MODE_INACT |
                                  /* Input function is not inverted */
                                  IOCON_PIO_INV_DI |
                                  /* Enables digital function */
                                  IOCON_PIO_DIGITAL_EN |
                                  /* Input filter disabled */
                                  IOCON_PIO_INPFILT_OFF |
                                  /* Standard mode, output slew rate control is enabled */
                                  IOCON_PIO_SLEW_STANDARD |
                                  /* Open drain is disabled */
                                  IOCON_PIO_OPENDRAIN_DI);
    /* PORT0 PIN30 (coords: A2) is configured as FC0_TXD_SCL_MISO */
    IOCON_PinMuxSet(IOCON, BOARD_PIN_ISP_FC0_TXD_PORT, BOARD_PIN_ISP_FC0_TXD_PIN, ISP_FC0_TXD);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
PIN_INIT_I2Cpins_HS:
- options: {callFromInitBoot: 'false', prefix: PIN_I2C_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: F11, peripheral: FLEXCOMM1, signal: CTS_SDA_SSEL0, pin_signal: PIO0_13/FC1_CTS_SDA_SSEL0/UTICK_CAP0/CTIMER0_CAP0/SCT0_GPI0/ENET_RXD0, identifier: PM2_SDA_HS,
    i2c_slew: i2c, i2c_drive: high}
  - {pin_num: E13, peripheral: FLEXCOMM1, signal: RTS_SCL_SSEL1, pin_signal: PIO0_14/FC1_RTS_SCL_SSEL1/UTICK_CAP1/CTIMER0_CAP1/SCT0_GPI1/ENET_RXD1, identifier: PM2_SCL_HS,
    i2c_slew: i2c, i2c_drive: high}
  - {pin_num: E2, peripheral: FLEXCOMM2, signal: RTS_SCL_SSEL1, pin_signal: PIO3_24/FC2_RTS_SCL_SSEL1/CTIMER4_CAP0/USB0_VBUS, identifier: PM1_SCL_HS, i2c_slew: i2c,
    i2c_drive: high}
  - {pin_num: C2, peripheral: FLEXCOMM2, signal: CTS_SDA_SSEL0, pin_signal: PIO3_23/FC2_CTS_SDA_SSEL0/UTICK_CAP3, identifier: PM1_SDA_HS, invert: disabled, i2c_slew: i2c,
    i2c_drive: high}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : PIN_INIT_I2Cpins_HS
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M4F */
void PIN_INIT_I2Cpins_HS(void)
{
    /* Enables the clock for the IOCON block. 0 = Disable; 1 = Enable.: 0x01u */
    CLOCK_EnableClock(kCLOCK_Iocon);

    IOCON->PIO[0][13] =
        ((IOCON->PIO[0][13] &
          /* Mask bits to zero which are setting */
          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_I2CSLEW_MASK | IOCON_PIO_DIGIMODE_MASK | IOCON_PIO_I2CDRIVE_MASK)))

         /* Selects pin function.
          * : PORT013 (pin F11) is configured as FC1_CTS_SDA_SSEL0. */
         | IOCON_PIO_FUNC(PIO013_FUNC_ALT1)

         /* Controls slew rate of I2C pad.
          * : I2C mode. */
         | IOCON_PIO_I2CSLEW(PIO013_I2CSLEW_I2C_MODE)

         /* Select Analog/Digital mode.
          * : Digital mode. */
         | IOCON_PIO_DIGIMODE(PIO013_DIGIMODE_DIGITAL)

         /* Controls the current sink capability of the pin.
          * : High drive.
          * Output drive sink is 20 mA.
          * This is needed for Fast Mode Plus I 2C.
          * Refer to the appropriate specific device data sheet for details. */
         | IOCON_PIO_I2CDRIVE(PIO013_I2CDRIVE_HIGH));

    IOCON->PIO[0][14] =
        ((IOCON->PIO[0][14] &
          /* Mask bits to zero which are setting */
          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_I2CSLEW_MASK | IOCON_PIO_DIGIMODE_MASK | IOCON_PIO_I2CDRIVE_MASK)))

         /* Selects pin function.
          * : PORT014 (pin E13) is configured as FC1_RTS_SCL_SSEL1. */
         | IOCON_PIO_FUNC(PIO014_FUNC_ALT1)

         /* Controls slew rate of I2C pad.
          * : I2C mode. */
         | IOCON_PIO_I2CSLEW(PIO014_I2CSLEW_I2C_MODE)

         /* Select Analog/Digital mode.
          * : Digital mode. */
         | IOCON_PIO_DIGIMODE(PIO014_DIGIMODE_DIGITAL)

         /* Controls the current sink capability of the pin.
          * : High drive.
          * Output drive sink is 20 mA.
          * This is needed for Fast Mode Plus I 2C.
          * Refer to the appropriate specific device data sheet for details. */
         | IOCON_PIO_I2CDRIVE(PIO014_I2CDRIVE_HIGH));

    IOCON->PIO[3][23] =
        ((IOCON->PIO[3][23] &
          /* Mask bits to zero which are setting */
          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_I2CSLEW_MASK | IOCON_PIO_INVERT_MASK | IOCON_PIO_DIGIMODE_MASK | IOCON_PIO_I2CDRIVE_MASK)))

         /* Selects pin function.
          * : PORT323 (pin C2) is configured as FC2_CTS_SDA_SSEL0. */
         | IOCON_PIO_FUNC(PIO323_FUNC_ALT1)

         /* Controls slew rate of I2C pad.
          * : I2C mode. */
         | IOCON_PIO_I2CSLEW(PIO323_I2CSLEW_I2C_MODE)

         /* Input polarity.
          * : Disabled.
          * Input function is not inverted. */
         | IOCON_PIO_INVERT(PIO323_INVERT_DISABLED)

         /* Select Analog/Digital mode.
          * : Digital mode. */
         | IOCON_PIO_DIGIMODE(PIO323_DIGIMODE_DIGITAL)

         /* Controls the current sink capability of the pin.
          * : High drive.
          * Output drive sink is 20 mA.
          * This is needed for Fast Mode Plus I 2C.
          * Refer to the appropriate specific device data sheet for details. */
         | IOCON_PIO_I2CDRIVE(PIO323_I2CDRIVE_HIGH));

    IOCON->PIO[3][24] =
        ((IOCON->PIO[3][24] &
          /* Mask bits to zero which are setting */
          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_I2CSLEW_MASK | IOCON_PIO_DIGIMODE_MASK | IOCON_PIO_I2CDRIVE_MASK)))

         /* Selects pin function.
          * : PORT324 (pin E2) is configured as FC2_RTS_SCL_SSEL1. */
         | IOCON_PIO_FUNC(PIO324_FUNC_ALT1)

         /* Controls slew rate of I2C pad.
          * : I2C mode. */
         | IOCON_PIO_I2CSLEW(PIO324_I2CSLEW_I2C_MODE)

         /* Select Analog/Digital mode.
          * : Digital mode. */
         | IOCON_PIO_DIGIMODE(PIO324_DIGIMODE_DIGITAL)

         /* Controls the current sink capability of the pin.
          * : High drive.
          * Output drive sink is 20 mA.
          * This is needed for Fast Mode Plus I 2C.
          * Refer to the appropriate specific device data sheet for details. */
         | IOCON_PIO_I2CDRIVE(PIO324_I2CDRIVE_HIGH));
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
